** elisp stuff
#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
  (async-shell-command "./work.sh" "log" "error")
#+end_src

#+RESULTS:
: #<window 2004 on log>

